mui.init({swipeBack: false
,gestureConfig: {tap:true,doubletap:true,longtap:true,hold:true,release:true}});

var 仔仔1 = new 仔仔("仔仔1",null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null);
var 如意特效对话框1 = new 如意特效对话框("如意特效对话框1",如意特效对话框1_对话框展示回调,如意特效对话框1_对话框隐藏回调);
var 网络操作1 = new 网络操作("网络操作1",网络操作1_发送完毕);
var 对话框1 = new 对话框("对话框1",null,null,null);
var 列表哥热更新1 = new 列表哥热更新("列表哥热更新1",null,null,null,null);
if(mui.os.plus){
    mui.plusReady(function() {
        主窗口_创建完毕();
        
    });
}else{
    window.onload=function(){ 
        主窗口_创建完毕();
        
    }
}

var 安装包版本号 = 公用模块.当前版本();
var 按下次数 = 0;
var json;
var 背景颜色;
var 默认颜色;
var 激活颜色;
检测主题颜色();
function 检测主题颜色(){
if (读写设置.读取设置("主题颜色") == "" || 读写设置.读取设置("主题颜色") == null || 读写设置.读取设置("主题颜色") == null) {读写设置.保存设置("主题颜色","黑金"),背景颜色 = "#000000",默认颜色 = "#f0f0f0",激活颜色 = "#FFE28A",搜索颜色 = "#3F3F3F",读写设置.保存设置("菜单消息","xx2.png"),读写设置.保存设置("菜单收藏","sc2.png"),读写设置.保存设置("菜单记录","jl2.png"),读写设置.保存设置("菜单代理","dl2.png"),读写设置.保存设置("首页图标1","sy2.png"),读写设置.保存设置("发现图标1","fx2.png"),读写设置.保存设置("直播图标1","zb2.png"),读写设置.保存设置("我的图标1","wd2.png"),读写设置.保存设置("背景图片","2.png")}
if (读写设置.读取设置("主题颜色") == "蓝白"){读写设置.保存设置("背景图片","1.png"),背景颜色 = "#0088FF",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#0078FF",读写设置.保存设置("菜单消息","xx1.png"),读写设置.保存设置("菜单收藏","sc1.png"),读写设置.保存设置("菜单记录","jl1.png"),读写设置.保存设置("菜单代理","dl1.png"),读写设置.保存设置("首页图标1","sy1.png"),读写设置.保存设置("发现图标1","fx1.png"),读写设置.保存设置("直播图标1","zb1.png"),读写设置.保存设置("我的图标1","wd1.png")}
if (读写设置.读取设置("主题颜色") == "黑金"){读写设置.保存设置("背景图片","2.png"),背景颜色 = "#000000",默认颜色 = "#f0f0f0",激活颜色 = "#FFE28A",搜索颜色 = "#3F3F3F",读写设置.保存设置("菜单消息","xx2.png"),读写设置.保存设置("菜单收藏","sc2.png"),读写设置.保存设置("菜单记录","jl2.png"),读写设置.保存设置("菜单代理","dl2.png"),读写设置.保存设置("首页图标1","sy2.png"),读写设置.保存设置("发现图标1","fx2.png"),读写设置.保存设置("直播图标1","zb2.png"),读写设置.保存设置("我的图标1","wd2.png")}
if (读写设置.读取设置("主题颜色") == "酷安绿"){读写设置.保存设置("背景图片","3.png"),背景颜色 = "#4BAF4E",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#44a444",读写设置.保存设置("菜单消息","xx3.png"),读写设置.保存设置("菜单收藏","sc3.png"),读写设置.保存设置("菜单记录","jl3.png"),读写设置.保存设置("菜单代理","dl3.png"),读写设置.保存设置("首页图标1","sy3.png"),读写设置.保存设置("发现图标1","fx3.png"),读写设置.保存设置("直播图标1","zb3.png"),读写设置.保存设置("我的图标1","wd3.png")}
if (读写设置.读取设置("主题颜色") == "网易红"){读写设置.保存设置("背景图片","4.png"),背景颜色 = "#D33A2F",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#CC3D50",读写设置.保存设置("菜单消息","xx4.png"),读写设置.保存设置("菜单收藏","sc4.png"),读写设置.保存设置("菜单记录","jl4.png"),读写设置.保存设置("菜单代理","dl4.png"),读写设置.保存设置("首页图标1","sy4.png"),读写设置.保存设置("发现图标1","fx4.png"),读写设置.保存设置("直播图标1","zb4.png"),读写设置.保存设置("我的图标1","wd4.png")}
if (读写设置.读取设置("主题颜色") == "哔哩粉"){读写设置.保存设置("背景图片","5.png"),背景颜色 = "#B47DB4",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#b06eb0",读写设置.保存设置("菜单消息","xx5.png"),读写设置.保存设置("菜单收藏","sc5.png"),读写设置.保存设置("菜单记录","jl5.png"),读写设置.保存设置("菜单代理","dl5.png"),读写设置.保存设置("首页图标1","sy5.png"),读写设置.保存设置("发现图标1","fx5.png"),读写设置.保存设置("直播图标1","zb5.png"),读写设置.保存设置("我的图标1","wd5.png")}
if (读写设置.读取设置("主题颜色") == "咖啡棕"){读写设置.保存设置("背景图片","6.png"),背景颜色 = "#75655A",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#685a50",读写设置.保存设置("菜单消息","xx6.png"),读写设置.保存设置("菜单收藏","sc6.png"),读写设置.保存设置("菜单记录","jl6.png"),读写设置.保存设置("菜单代理","dl6.png"),读写设置.保存设置("首页图标1","sy6.png"),读写设置.保存设置("发现图标1","fx6.png"),读写设置.保存设置("直播图标1","zb6.png"),读写设置.保存设置("我的图标1","wd6.png")}
if (读写设置.读取设置("主题颜色") == "柠檬橙"){读写设置.保存设置("背景图片","7.png"),背景颜色 = "#D88100",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#cd7b02",读写设置.保存设置("菜单消息","xx7.png"),读写设置.保存设置("菜单收藏","sc7.png"),读写设置.保存设置("菜单记录","jl7.png"),读写设置.保存设置("菜单代理","dl7.png"),读写设置.保存设置("首页图标1","sy7.png"),读写设置.保存设置("发现图标1","fx7.png"),读写设置.保存设置("直播图标1","zb7.png"),读写设置.保存设置("我的图标1","wd7.png")}
if (读写设置.读取设置("主题颜色") == "星空灰"){读写设置.保存设置("背景图片","8.png"),背景颜色 = "#364F59",默认颜色 = "#f0f0f0",激活颜色 = "#FFFFFF",搜索颜色 = "#314750",读写设置.保存设置("菜单消息","xx8.png"),读写设置.保存设置("菜单收藏","sc8.png"),读写设置.保存设置("菜单记录","jl8.png"),读写设置.保存设置("菜单代理","dl8.png"),读写设置.保存设置("首页图标1","sy0.png"),读写设置.保存设置("发现图标1","fx0.png"),读写设置.保存设置("直播图标1","zb0.png"),读写设置.保存设置("我的图标1","wd0.png")}
读写设置.保存设置("背景颜色",背景颜色),读写设置.保存设置("默认颜色",默认颜色),读写设置.保存设置("激活颜色",激活颜色),读写设置.保存设置("搜索颜色",搜索颜色);
}
function 主窗口_创建完毕(){
	窗口操作.预加载窗口("index1.html");
	窗口操作.设置状态栏颜色(背景颜色);
	if(读写设置.读取设置("自动播放") == null ){
		读写设置.保存设置("自动播放","真");
	}else{
		读写设置.保存设置("自动播放",读写设置.读取设置("自动播放"));
	}

	网络操作1.发送网络请求(公用模块.AdminGuanLi() + "/peizhi.php","get","txt","",12000);
}
function 如意特效对话框1_对话框隐藏回调(){
窗口操作.打开指定网址(json.HBxz,2);
}
function 如意特效对话框1_对话框展示回调(){

}
function 网络操作1_发送完毕(发送结果,返回信息){
	if (发送结果 == true) {json = 转换操作.文本转json(仔仔1.编码_base64解密(公用模块.取中间文本(返回信息,"{brC46jF","}")));
	console.log(json);
	读写设置.保存设置("视频分类",公用模块.取中间文本(返回信息,"<li>","|</li"));
	读写设置.保存设置("首页广告",(json.HBgao));
	读写设置.保存设置("首页广告",文本操作.删全部空(json.HBgao));
	读写设置.保存设置("轮播广告2",文本操作.删全部空(json.HBgao2));
	读写设置.保存设置("轮播广告3",文本操作.删全部空(json.HBgao3));
	读写设置.保存设置("轮播广告4",文本操作.删全部空(json.HBgao4));
	读写设置.保存设置("轮播广告5",文本操作.删全部空(json.HBgao5));
	读写设置.保存设置("轮播广告6",文本操作.删全部空(json.HBgao6));
	读写设置.保存设置("运营模式",文本操作.删全部空(json.HBms));
	读写设置.保存设置("最新版本",文本操作.删全部空(json.HBbb));
	console.log(json.HBbb)
	读写设置.保存设置("下载地址",文本操作.删全部空(json.HBxz));
	读写设置.保存设置("软件价格",文本操作.删全部空(json.HBrjjg));
	读写设置.保存设置("卡密购买地址",文本操作.删全部空(json.HBzfb));
	读写设置.保存设置("广告模式",文本操作.删全部空(json.HBggms));
	读写设置.保存设置("分享标题",文本操作.删全部空(json.HBmr));
	读写设置.保存设置("分享内容",文本操作.删全部空(json.HBjk));
	读写设置.保存设置("分享图片",文本操作.删全部空(json.HBjxpz));
	读写设置.保存设置("APPID",文本操作.删全部空(json.HBweixinid));
	读写设置.保存设置("联系方式",文本操作.删全部空(json.HBqq));
	读写设置.保存设置("QQ群聊",文本操作.删全部空(json.HBkey));
	读写设置.保存设置("码支付ID",文本操作.删全部空(json.HBID));
	读写设置.保存设置("码支付TOKEN",文本操作.删全部空(json.HBKEY));

if (安装包版本号 == json.HBbb){
	窗口操作.取指定窗口("index1.html").show("none", 0);
	}else{
	如意特效对话框1.置对话框的样式("flip-horizontal-3d");
	如意特效对话框1.置关闭按钮样式("btn-danger");
	如意特效对话框1.置标题背景颜色("#FB7299");
	如意特效对话框1.置标题文字颜色("#FFFFFF");
	如意特效对话框1.置内容背景颜色("#FB7299");
	如意特效对话框1.置内容文字颜色("#FFFFFF");
	如意特效对话框1.置对话框的标题("升级提示");
	如意特效对话框1.置对话框的内容("</br><ul>" + json.HBnr + "</ul>");
	如意特效对话框1.置关闭按钮文字("更新");
	如意特效对话框1.更新对话框();
	如意特效对话框1.弹出对话框();
	}
}
}